import json

with open('./categories', "w", encoding="UTF-8") as file:
    json.dump({"sport": ['والیبال', 'فوتبال', 'ورزشی', 'جودو',
                                       'کشتی', 'رشته', 'فوتسال', 'شنا', 'جام جهانی', 'بسکتبال', 'لیگ'],
                             "bank": ['پول', 'شعب', 'اسکناس', 'ریال', 'وام',
                                      'اوراق', 'قرض الحسنه', 'حساب', 'رمز دوم', 'ملت'],
                             "trip": ['سفر', 'شمال', 'پول', 'هزینه', 'پاسپورت',
                                      'زمان', 'جنوب', 'حرکت', 'تعطیلات', 'هتل'],
                             "politics": ['سیاست', 'رییس جمهور', 'وزیر', 'بودجه',
                                          'رای', 'رهبر', 'دولت', 'انتخابات', 'مجلس', 'دادگاه'],
                             "kids": ['سرگرمی', 'پرستار', 'بچه', 'تربیت', 'کودک',
                                      'بازی', 'مدرسه', 'دکتر', 'درس', 'پارک'],
                             "health": ['تغذیه', 'دکتر', 'بهداشت', 'روزانه',
                                        'لبنیات', 'متخصص', 'بیماری', 'درمان', 'آزمایش', 'معاینه'],
                             "car & motorcycle": ['موتور', 'سواری', 'بنز', 'دنده',
                                                  'چرخ', 'سرعت', 'پژو', 'ماشین', 'قطعه', 'بنزین'],
                             "religion": ['دین', 'رهبر', 'مذهب', 'شیعه', 'اسلام',
                                          'مسیحیت', 'امام', 'پیامبر', 'خدا', 'یهود'],
                             "makeup": ['کرم', 'چشم', 'رژ', 'آرایش', 'پوست',
                                        'برند', 'رنگ', 'زیبا', 'عروس', 'سایه'],
                             "technology": ['علم', 'شبکه', 'داده', 'تکنولوژی',
                                            'اختراع', 'تحلیل', 'هوش مصنوعی', 'کامپیوتر', 'ماشین', 'ربات']
               }, file, ensure_ascii=False, indent=4)

